#+Title: Math With R


#+NAME:
#+HEADER: :file myplot.png
#+HEADER: :dir .
#+BEGIN_SRC R :session s1 :results xx :exports both

  f2xmais1 <- function(x){
   return (x^2-5i5*x);
  }
  curve( f2xmais1(x) , from = -100, to = 100, main = "exp(x)")
#+END_SRC

#+RESULTS: 
| -100 | 15500 |
|  -98 | 14994 |
|  -96 | 14496 |
|  -94 | 14006 |
|  -92 | 13524 |
|  -90 | 13050 |
|  -88 | 12584 |
|  -86 | 12126 |
|  -84 | 11676 |
|  -82 | 11234 |
|  -80 | 10800 |
|  -78 | 10374 |
|  -76 |  9956 |
|  -74 |  9546 |
|  -72 |  9144 |
|  -70 |  8750 |
|  -68 |  8364 |
|  -66 |  7986 |
|  -64 |  7616 |
|  -62 |  7254 |
|  -60 |  6900 |
|  -58 |  6554 |
|  -56 |  6216 |
|  -54 |  5886 |
|  -52 |  5564 |
|  -50 |  5250 |
|  -48 |  4944 |
|  -46 |  4646 |
|  -44 |  4356 |
|  -42 |  4074 |
|  -40 |  3800 |
|  -38 |  3534 |
|  -36 |  3276 |
|  -34 |  3026 |
|  -32 |  2784 |
|  -30 |  2550 |
|  -28 |  2324 |
|  -26 |  2106 |
|  -24 |  1896 |
|  -22 |  1694 |
|  -20 |  1500 |
|  -18 |  1314 |
|  -16 |  1136 |
|  -14 |   966 |
|  -12 |   804 |
|  -10 |   650 |
|   -8 |   504 |
|   -6 |   366 |
|   -4 |   236 |
|   -2 |   114 |
|    0 |     0 |
|    2 |  -106 |
|    4 |  -204 |
|    6 |  -294 |
|    8 |  -376 |
|   10 |  -450 |
|   12 |  -516 |
|   14 |  -574 |
|   16 |  -624 |
|   18 |  -666 |
|   20 |  -700 |
|   22 |  -726 |
|   24 |  -744 |
|   26 |  -754 |
|   28 |  -756 |
|   30 |  -750 |
|   32 |  -736 |
|   34 |  -714 |
|   36 |  -684 |
|   38 |  -646 |
|   40 |  -600 |
|   42 |  -546 |
|   44 |  -484 |
|   46 |  -414 |
|   48 |  -336 |
|   50 |  -250 |
|   52 |  -156 |
|   54 |   -54 |
|   56 |    56 |
|   58 |   174 |
|   60 |   300 |
|   62 |   434 |
|   64 |   576 |
|   66 |   726 |
|   68 |   884 |
|   70 |  1050 |
|   72 |  1224 |
|   74 |  1406 |
|   76 |  1596 |
|   78 |  1794 |
|   80 |  2000 |
|   82 |  2214 |
|   84 |  2436 |
|   86 |  2666 |
|   88 |  2904 |
|   90 |  3150 |
|   92 |  3404 |
|   94 |  3666 |
|   96 |  3936 |
|   98 |  4214 |
|  100 |  4500 |


